function K₀_eular(beam::Beam)::Matrix{Float64}
    E,ν=beam.material.E,beam.material.ν
    A,I₂,I₃,J,l=beam.section.A,beam.section.I₂,beam.section.I₃,beam.section.J,beam.l
    As₂,As₃=beam.section.As₂,beam.section.As₃
    G=E/2/(1+ν)
    ϕ₂,ϕ₃=12E*I₃/(G*As₂*l^2),12E*I₂/(G*As₃*l^2)
    K₀=zeros(12,12)
    kx=E*A/l
    kt=G*J/l
    ky1=12*E*I₂/l^3
    ky2=6*E*I₂/l^2
    ky3=2*E*I₂/l
    kz1=12*E*I₃/l^3
    kz2=6*E*I₃/l^2
    kz3=2*E*I₃/l
    K₀[1,1]=kx
    K₀[2,2]=kz1
    K₀[3,3]=ky1
    K₀[4,4]=kt
    K₀[5,3]=-ky2;K₀[5,5]=2ky3
    K₀[6,2]=kz2;K₀[6,6]=2kz3
    K₀[7,1]=-kx;K₀[7,7]=kx
    K₀[8,2]=-kz1;K₀[8,6]=-kz2;K₀[8,8]=kz1
    K₀[9,3]=-ky1;K₀[9,5]=-ky2;K₀[9,9]=ky1
    K₀[10,4]=-kt;K₀[10,10]=kt
    K₀[11,3]=-ky2;K₀[11,5]=ky3;K₀[11,9]=ky2;K₀[11,11]=2ky3
    K₀[12,2]=-kz2;K₀[12,6]=kz3;K₀[12,8]=-kz2;K₀[12,12]=2kz3
    return K
end

function Kd_eular(beam::Beam,u::Vector{Float64})::Matrix{Float64}
    E,ν=beam.material.E,beam.material.ν
    A,I₂,I₃,J,l=beam.section.A,beam.section.I₂,beam.section.I₃,beam.section.J,beam.l
    As₂,As₃=beam.section.As₂,beam.section.As₃
    G=E/2/(1+ν)
    T=σ*A
    Δu=uᵢ-uⱼ
    Δv=vᵢ-vⱼ
    Δw=wᵢ-wⱼ
    Δϕy=ϕyᵢ-ϕyⱼ
    Δϕz=ϕzᵢ-ϕzⱼ
    ϕ1=ϕzᵢ+ϕyⱼ
    ϕ2=ϕzᵢ+ϕzⱼ
    ϕ3=ϕyᵢ*ϕzᵢ+ϕyⱼ*ϕzⱼ
    ϕ4=ϕyᵢ*ϕzᵢ-ϕyⱼ*ϕzⱼ
    ϕ5=ϕyᵢ*ϕzⱼ+ϕyⱼ*ϕzᵢ

    Kd¹=zeros(12,12)
    Kd¹[2,1]=-(12Δv+l*ϕ2)/(10l^2)
    Kd¹[6,1]=-(3Δv+4l*ϕzᵢ-l*ϕzⱼ)/(30l)
    Kd¹[12,1]=-(3Δv-l*ϕzᵢ+4ϕzⱼ)/(30l)
    Kd¹[2,2]=(72Δv^2+3l^2ϕzᵢ^2+3l^2ϕzⱼ^2)/(35l^3)+18Δv*ϕ2/(35l^2)
    Kd¹[6,2]=(9Δv^2+6lΔv*ϕzᵢ)/(35l^2)-(Δϕz^2-2ϕzⱼ^2)/140
    Kd¹[12,2]=(9Δv^2+6lΔv*ϕzⱼ)/(35l^2)-(Δϕz^2-2ϕzⱼ^2)/140
    Kd¹[6,6]=3Δv^2/(35l)-Δv*Δϕz/70+2*l*ϕzᵢ^2/35+l*ϕzⱼ^2/210-l*ϕzᵢ*ϕzⱼ/70
    Kd¹[12,6]=Δv*ϕ2/70-l*(ϕzᵢ^2+ϕzⱼ^2)/140+l*ϕzi*ϕzⱼ/105
    Kd¹[12,12]=3Δv^2/(35l)+Δv*Δϕz/70+l*ϕzᵢ^2/210+2*l*ϕzⱼ^2/35-l*ϕzᵢ*ϕzⱼ/70

    Kd²=zeros(12,12)
    Kd²[3,1]=-(12Δw+l*ϕ2)/(10l^2)
    Kd²[5,1]=-(3Δw+4l*ϕyᵢ-l*ϕzⱼ)/(30l)
    Kd²[11,1]=-(3Δw-l*ϕzᵢ+4ϕzⱼ)/(30l)
    Kd²[3,3]=(72Δw^2+3l^2ϕzᵢ^2+3l^2ϕzⱼ^2)/(35l^3)+18Δw*ϕ2/(35l^2)
    Kd²[5,3]=(9Δw^2+6lΔw*ϕzᵢ)/(35l^2)-(Δϕz^2-2ϕzⱼ^2)/140
    Kd²[11,3]=(9Δw^2+6lΔw*ϕzⱼ)/(35l^2)-(Δϕz^2-2ϕzⱼ^2)/140
    Kd²[5,5]=3Δw^2/(35l)-Δw*Δϕz/70+2*l*ϕzᵢ^2/35+l*ϕzⱼ^2/210-l*ϕzᵢ*ϕzⱼ/70
    Kd²[11,5]=Δw*ϕ2/70-l*(ϕzᵢ^2+ϕzⱼ^2)/140+l*ϕzi*ϕzⱼ/105
    Kd²[11,11]=3Δw^2/(35l)+Δw*Δϕz/70+l*ϕzᵢ^2/210+2*l*ϕzⱼ^2/35-l*ϕzᵢ*ϕzⱼ/70

    Kd³=zeros(12,12)
    Kd³[3,2]=(72Δv*Δw-9*l*Δv*ϕ1+9l*Δw*ϕ2-3l^2*ϕ3)/(35l^3)
    Kd³[5,2]=-3*(3Δv*Δw+lΔw*ϕzᵢ-l*Δv*ϕyᵢ)/(35l^2)-(ϕ4-ϕ5)/140
    Kd³[11,2]=-3*(3Δv*Δw+lΔw*ϕzⱼ-l*Δv*ϕyⱼ)/(35l^2)-(ϕ4-ϕ5)/140
    Kd³[6,5]=-(3Δv*Δw)/(35l)-(Δv*Δϕy-Δw*Δϕz)/140-l*ϕ5/140+2*l*ϕyᵢ*ϕzᵢ/35+l*ϕyⱼ*ϕzⱼ/210
    Kd³[12,5]=(Δv*ϕ1-Δw*ϕ2+l*ϕ3)/140+l*ϕ5/210
    Kd³[12,11]=-(3Δv*Δw)/(35l)-(Δv*Δϕy-Δw*Δϕz)/140-l*ϕ5/140+2*l*ϕyⱼ*ϕzⱼ/35+l*ϕyᵢ*ϕzᵢ/210

    Kd⁴=zeros(12,12)
    Kd⁴[1,1]=-2*Δu/l^2+Δu^2/l^3
    Kd⁴[2,1]=6Δu*Δv/(5l^3)+Δu*ϕ2/(10l^2)
    Kd⁴[3,1]=6Δu*Δw/(5l^3)-Δu*ϕ1/(10l^2)
    Kd⁴[5,1]=-Δu*Δw/(10l^2)+2Δu*ϕyᵢ/(15l)-Δu*ϕyⱼ/(30l)
    Kd⁴[6,1]=Δu*Δv/(10l^2)+2Δu*ϕzᵢ/(15l)-Δu*ϕzⱼ/(30l)
    Kd⁴[11,1]=-Δu*Δw/(10l^2)-Δu*ϕyᵢ/30l+2Δu*ϕyⱼ/15l
    Kd⁴[12,1]=Δu*Δv/(10l^2)-Δu*ϕzᵢ/30l+2Δu*ϕzⱼ/15l
    return E*A*(Kd¹+Kd²+Kd³+Kd⁴)
end

function Kσ_eular(beam::Beam,u::Vector{Float64})::Matrix{Float64}
    E,ν=beam.material.E,beam.material.ν
    A,I₂,I₃,J,l=beam.section.A,beam.section.I₂,beam.section.I₃,beam.section.J,beam.l
    As₂,As₃=beam.section.As₂,beam.section.As₃
    G=E/2/(1+ν)
    T=σ*A
    Δu=uᵢ-uⱼ
    Δv=vᵢ-vⱼ
    Δw=wᵢ-wⱼ
    Δϕy=ϕyᵢ-ϕyⱼ
    Δϕz=ϕzᵢ-ϕzⱼ
    ϕ1=ϕzᵢ+ϕyⱼ
    ϕ2=ϕzᵢ+ϕzⱼ
    ϕ3=ϕyᵢ*ϕzᵢ+ϕyⱼ*ϕzⱼ
    ϕ4=ϕyᵢ*ϕzᵢ-ϕyⱼ*ϕzⱼ
    ϕ5=ϕyᵢ*ϕzⱼ+ϕyⱼ*ϕzᵢ

    # Kσ¹=Kσ¹₁+Kσ¹₂+Kσ¹₃+Kσ¹₄
    Kσ¹=zeros(12,12)
    Kσ¹[1,1]= -Δu/l^2 + Δu^2/l^3 + 3Δv^2/(5l^3)+(2ϕ2^2-5ϕzᵢ*ϕzⱼ)/30l+Δv*ϕ2/(10l^2) + 3Δw^2/(5l^3)+(2ϕ2^2-5ϕyᵢ*ϕyⱼ)/30l+Δw*ϕ2/(10l^2)
    Kσ¹[1,7]=-Kσ¹[1,1]
    Kσ¹[7,7]=Kσ¹[1,1]
    Kσ¹*=E*A
####################
    λ₁=Δu/l*E*A
    λ₂=-Δu^2/(2l^2)*E*A
    Kσ²₁=zeros(12,12)
    Kσ²₁[2,2]=-6/(5*l)
    Kσ²₁[6,2]=-1/10
    Kσ²₁[6,6]=-2l/15
    Kσ²₁[8,2]=6/(5*l)
    Kσ²₁[8,6]=1/10
    Kσ²₁[8,8]=-6/(5*l)
    Kσ²₁[12,2]=-1/10
    Kσ²₁[12,6]=l/30
    Kσ²₁[12,8]=1/10
    Kσ²₁[12,12]=-2l/15
    Kσ²₁=Kσ²₁*λ₁
    Kσ²₂=Kσ²₁*λ₂

    Kσ²₃=zeros(12,12)
    Kσ²₃[2,2]=36Δv^2/(35l^3)+9Δv*ϕ2/(35l^2)+3(ϕzᵢ^2+ϕzⱼ^2)/(70l)
    Kσ²₃[6,2]=9Δv^2/(70l^2)+3Δv*ϕzᵢ/35l-(Δϕ2^2-2ϕzⱼ^2)/280#may be wrong
    Kσ²₃[6,6]=3Δv^2/(70l)-Δv*ϕz/140+l*ϕzᵢ^2/35+l*ϕzⱼ^2/420-l*ϕzᵢ*ϕzⱼ/140
    Kσ²₃[12,2]=9Δv^2/(70l^2)+3Δv*ϕzⱼ/35l-(Δϕ2^2-2ϕzⱼ^2)/280#may be wrong
    Kσ²₃[12,6]=Δv*ϕ₂/140-l*(ϕzᵢ^2+ϕzⱼ^2)/280+l*ϕzᵢ*ϕzⱼ/210
    Kσ²₃[12,12]=3Δv^2/(70l)+Δv*Δϕ2/140+l*ϕzᵢ^2/140+l*ϕzⱼ^2/35-l*ϕzᵢ*ϕzⱼ/140#may be wrong

    Kσ²₃[8,2]=-Kσ²₃[2,2];Kσ²₃[8,6]=-Kσ²₃[6,2];Kσ²₃[8,8]=Kσ²₃[2,2]
    Kσ²₃[12,8]=-Kσ²₃[12,2];#Kσ²₃[12,12]=Kσ²₃[12,2]
    Kσ²₃*=E*A

    Kσ²₄=zeros(12,12)
    Kσ²₄[2,2]=36Δw^2/(35l^3)+9Δw*ϕ2/(35l^2)+3((-ϕyᵢ)^2+(-ϕyⱼ)^2)/(70l)
    Kσ²₄[6,2]=9Δw^2/(70l^2)+3Δw*(-ϕyᵢ)/35l-(Δϕ2^2-2(-ϕyⱼ)^2)/280#may be wrong
    Kσ²₄[6,6]=3Δw^2/(70l)-Δw*(-ϕy)/140+l*(-ϕyᵢ)^2/35+l*(-ϕyⱼ)^2/420-l*(-ϕyᵢ)*(-ϕyⱼ)/140
    Kσ²₄[12,2]=9Δw^2/(70l^2)+3Δw*(-ϕyⱼ)/35l-(Δϕ2^2-2(-ϕyⱼ)^2)/280#may be wrong
    Kσ²₄[12,6]=Δw*ϕ₂/140-l*((-ϕyᵢ)^2+(-ϕyⱼ)^2)/280+l*(-ϕyᵢ)*(-ϕyⱼ)/210
    Kσ²₄[12,12]=3Δw^2/(70l)+Δw*Δϕ2/140+l*(-ϕyᵢ)^2/140+l*(-ϕyⱼ)^2/35-l*(-ϕyᵢ)*(-ϕyⱼ)/140#may be wrong

    Kσ²₄[8,2]=-Kσ²₄[2,2];Kσ²₄[8,6]=-Kσ²₄[6,2];Kσ²₄[8,8]=Kσ²₄[2,2]
    Kσ²₄[12,8]=-Kσ²₄[12,2];#Kσ²₄[12,12]=Kσ²₄[12,2]
    Kσ²₄*=E*A

    Kσ²=Kσ²₁+Kσ²₂+Kσ²₃+Kσ²₄

###########################
    Kσ³₁=zeros(12,12)
    Kσ³₁[3,3]=-6/(5l)
    Kσ³₁[5,3]=1/10
    Kσ³₁[5,5]=-2l/15
    Kσ³₁[9,3]=6/(5l)
    Kσ³₁[9,5]=-1/10
    Kσ³₁[9,9]=-6/(5l)
    Kσ³₁[11,3]=1/10
    Kσ³₁[11,5]=l/30
    Kσ³₁[11,10]=-1/10
    Kσ³₁[11,11]=-2l/15
    Kσ³₁=Kσ²₁*λ₁
    Kσ³₂=Kσ²₁*λ₂

    Kσ³₃=zeros(12,12)
    Kσ³₃[3,3]=Kσ²₃[2,2]
    Kσ³₃[5,3]=-Kσ²₃[6,2]
    Kσ³₃[5,5]=Kσ²₃[6,6]
    Kσ³₃[11,3]=-Kσ²₃[12,2]
    Kσ³₃[11,5]=Kσ²₃[12,6]
    Kσ³₃[11,11]=Kσ²₃[12,12]

    Kσ³₃[9,3]=-Kσ³₃[3,3];Kσ³₃[9,5]=-Kσ³₃[5,3];Kσ³₃[9,9]=Kσ³₃[3,3]
    Kσ³₃[11,9]=-Kσ³₃[11,3]
    Kσ³₃*=E*A

    Kσ³₄=zeros(12,12)
    Kσ³₄[2,2]=Kσ²₄[2,2]
    Kσ³₄[6,2]=-Kσ²₄[6,2]
    Kσ³₄[6,6]=Kσ²₄[6,6]
    Kσ³₄[12,2]=-Kσ²₄[12,2]
    Kσ³₄[12,6]=Kσ²₄[12,6]
    Kσ³₄[12,12]=Kσ²₄[12,12]

    Kσ³₄[9,3]=-Kσ³₄[3,3];Kσ³₄[9,5]=-Kσ³₄[5,3];Kσ³₄[9,9]=Kσ³₄[3,3]
    Kσ³₄[11,9]=-Kσ³₄[11,3]
    Kσ³₄*=E*A

    Kσ³=Kσ³₁+Kσ³₂+Kσ³₃+Kσ³₄
    
    return Kσ¹+Kσ²+Kσ³
end

function P_eular(beam::Beam,f::Vector{Float64},ϵ₀::Vector{Float64},)::Vector{Float64}
    l=beam.l
    fi,v2i,v3i,ti,m2i,m3i,fj,v2j,v3j,tj,m2j,m3j=f
    Nᵀf(x)=[
          0;
    (1 - 3*x^2 + 2*x^3)*(v2i + x*(-v2i + v2j));
    (1 - 3*x^2 + 2*x^3)*(v3i + x*(-v3i + v3j));
          0;
    l*(x - 2*x^2 + x^3)*(v3i + x*(-v3i + v3j));
    l*(x - 2*x^2 + x^3)*(v2i + x*(-v2i + v2j));
          0;
        (3*x^2 - 2*x^3)*(v2i + x*(-v2i + v2j));
        (3*x^2 - 2*x^3)*(v3i + x*(-v3i + v3j));
         0;
         l*(-x^2 + x^3)*(v3i + x*(-v3i + v3j));
         l*(-x^2 + x^3)*(v2i + x*(-v2i + v2j));
   ]*l
   Nᵀf2(x)=[
         -0.5*(-1 + x)*(fi + (1+x)/2*(-fi + fj));0;0;
         -0.5*(-1 + x)*(ti + (1+x)/2*(-ti + tj));0;0;
           0.5*(1 + x)*(fi + (1+x)/2*(-fi + fj));0;0;
           0.5*(1 + x)*(ti + (1+x)/2*(-ti + tj));0;0
    ]*l/2

    Pᵉᶠ=hquadrature(Nᵀf,0,1)[1]+hquadrature(Nᵀf2,-1,1)[1]#Pᵉf=∫NᵀfdV #体积力

    f₁,f₂=ϵ₀[1],ϵ₀[2]
    BᵀDϵ₀(x)=[-0.5*(f₁+0.5*(x+1)*(-f₁+f₂));
               0.5*(f₁+0.5*(x+1)*(-f₁+f₂))]*beam.l/2
    a,b=hquadrature(BᵀDϵ₀,-1,1)[1]*beam.material.E*beam.section.A# Pᵉϵ₀=∫BᵀDϵ₀dV #初应变
    Pᵉᵋ=[a,0,0,0,0,0,b,0,0,0,0,0]
    return reshape(Pᵉᶠ+Pᵉᵋ,12)
end

function f_eular(elm::Beam,uᵉ::Vector{Float64})::Vector{Float64}
    rDOF=findall(x->x==true,elm.release)
    Kᵉ=K_eular_shear(elm)
    K̃ᵉ,P̃ᵉ=static_condensation(K̃ᵉ,zeros(12),rDOF)
    return K̃ᵉ*uᵉ
end

function W_eular(elm::Beam,uᵉ::Vector{Float64})::Float64
    rDOF=findall(x->x==true,elm.release)
    Kᵉ=K_eular_shear(elm)
    K̃ᵉ,P̃ᵉ=static_condensation(K̃ᵉ,zeros(12),rDOF)
    return uᵉ'*(K̃ᵉ*uᵉ)
end
